{"cvrfdoc":{"document_title":"Red Hat Security Advisory: php security update","document_distribution":"Copyright © 2021 Red Hat, Inc. All rights reserved.","document_references":{"reference":[{"description":"https://access.redhat.com/errata/RHSA-2002:129","type":"Self","url":"https://access.redhat.com/errata/RHSA-2002:129"},{"description":"","type":"External","url":""}]},"aggregate_severity":"Important","document_tracking":{"initial_release_date":"2002-06-26T00:00:00Z","identification":{"id":"RHSA-2002:129"},"revision_history":{"revision":{"date":"2002-06-26T00:00:00Z","number":"1","description":"Current version"}},"generator":{"date":"2021-08-23T04:26:00Z","engine":"Red Hat SDEngine 3.0.0"},"current_release_date":"2002-06-26T00:00:00Z","version":"1","status":"Final"},"document_publisher":{"issuing_authority":"Red Hat Product Security","contact_details":"secalert@redhat.com","type":"Vendor"},"vulnerability":[{"notes":{"note":"security flaw"},"cve":"CVE-2001-1246","references":{"reference":[{"description":"CVE-2001-1246","url":"https://access.redhat.com/security/cve/CVE-2001-1246"},{"description":"bz#1616654: CVE-2001-1246 security flaw","url":"https://bugzilla.redhat.com/show_bug.cgi?id=1616654"}]},"release_date":"2001-06-30T00:00:00Z","involvements":{"involvement":{"party":"Vendor","status":"Completed"}},"remediations":{"remediation":{"description":"Please Note:\nThe /etc/php.ini configuration file is not replaced or\noverwritten. You should carefully review your configuration file and adapt\nit to your server or service functions.\nBefore applying this update, make sure all previously released errata\nrelevant to your system have been applied.\nPlease note that this update is available via Red Hat Network.  To use Red\nHat Network, launch the Red Hat Update Agent with the following command:\nup2date\nThis will start an interactive process that will result in the appropriate\nRPMs being upgraded on your system.","type":"Vendor Fix","url":"https://access.redhat.com/errata/RHSA-2002:129"}},"threats":{"threat":{"description":"Important","type":"Impact"}},"ordinal":"1"}],"document_notes":{"note":["PHP versions earlier than 4.1.0 contain a vulnerability that could allow\narbitrary commands to be executed.\n[updated 22 Aug 2002]\nThe initial set of errata packages contained an incorrect set of\ndependencies. This meant that a number of packages would need to be\ninstalled before php that were not essential to the operation of php. \nUpdated errata packages are included with this advisory that have corrected\ndependencies.","PHP is an HTML-embedded scripting language commonly used with Apache. PHP\nversions 4.0.5 through 4.1.0 in safe mode do not properly cleanse the 5th\nparameter to the mail() function. This vulnerability allows local users and\npossibly remote attackers to execute arbitrary commands via shell\nmetacharacters.\nRed Hat Linux Advanced Server version 2.1 shipped with PHP 4.0.6.\nThe Common Vulnerabilities and Exposures project (cve.mitre.org) has\nassigned the name CAN-2001-1246 to this issue.\nAll users of PHP should upgrade to these errata packages containing PHP\n4.1.2, which is not vulnerable to this issue.\nNote:\nThis PHP errata enforces memory limits on the size of the PHP process to\nprevent a badly generated script from becoming a possible source for a\ndenial of service attack. The default process size is 8Mb though you can\nadjust this as you deem necessary thought the php.ini directive\nmemory_limit. For example, to change the process memory limit to 4MB, add\nthe following:\nmemory_limit 4194304\nImportant Installation Note:\nThere are special instructions you should follow regarding your\n/etc/php.ini configuration file in the \"Solution\" section below.","This content is licensed under the Creative Commons Attribution 4.0 International License (https://creativecommons.org/licenses/by/4.0/). If you distribute this content, or a modified version of it, you must provide attribution to Red Hat Inc. and provide a link to the original."]},"document_type":"Security Advisory"}}