{"cvrfdoc":{"document_title":"Red Hat Security Advisory: New samba packages available to fix potential security vulnerability","document_distribution":"Copyright © 2021 Red Hat, Inc. All rights reserved.","document_references":{"reference":[{"description":"https://access.redhat.com/errata/RHSA-2002:266","type":"Self","url":"https://access.redhat.com/errata/RHSA-2002:266"},{"description":"","type":"External","url":""}]},"aggregate_severity":"","document_tracking":{"initial_release_date":"2002-11-22T17:33:00Z","identification":{"id":"RHSA-2002:266"},"revision_history":{"revision":{"date":"2003-02-07T00:00:00Z","number":"1","description":"Current version"}},"generator":{"date":"2021-08-23T04:30:00Z","engine":"Red Hat SDEngine 3.0.0"},"current_release_date":"2003-02-07T00:00:00Z","version":"1","status":"Final"},"document_publisher":{"issuing_authority":"Red Hat Product Security","contact_details":"secalert@redhat.com","type":"Vendor"},"vulnerability":[{"notes":{"note":"security flaw"},"cve":"CVE-2002-1318","references":{"reference":[{"description":"CVE-2002-1318","url":"https://access.redhat.com/security/cve/CVE-2002-1318"},{"description":"bz#1616871: CVE-2002-1318 security flaw","url":"https://bugzilla.redhat.com/show_bug.cgi?id=1616871"}]},"release_date":"2002-11-20T00:00:00Z","involvements":{"involvement":{"party":"Vendor","status":"Completed"}},"remediations":{"remediation":{"description":"Before applying this update, make sure all previously released errata\nrelevant to your system have been applied.\nTo update all RPMs for your particular architecture, run:\nrpm -Fvh [filenames]\nwhere [filenames] is a list of the RPMs you wish to upgrade.  Only those\nRPMs which are currently installed will be updated.  Those RPMs which are\nnot installed but included in the list will not be updated.  Note that you\ncan also use wildcards (*.rpm) if your current directory *only* contains the\ndesired RPMs.\nPlease note that this update is also available via Red Hat Network.  Many\npeople find this an easier way to apply updates.  To use Red Hat Network,\nlaunch the Red Hat Update Agent with the following command:\nup2date\nThis will start an interactive process that will result in the appropriate\nRPMs being upgraded on your system.","type":"Vendor Fix","url":"https://access.redhat.com/errata/RHSA-2002:266"}},"ordinal":"1"}],"document_notes":{"note":["New samba packages are available that fix a security vulnerability present\nin samba versions 2.2.2 through 2.2.6. A potential attacker could gain\nroot access on the target machine. It is strongly encouraged that all Samba\nusers update to the fixed packages.\nAs of this time, there are no known exploits for this vulnerability.","There was a bug in the length checking for encrypted password change\nrequests from clients. A client could potentially send an encrypted\npassword, which, when decrypted with the old hashed password, could be\nused as a buffer overrun attack on smbd's stack. The attack would\nhave to be crafted such that converting a DOS codepage string to little\nendian UCS2 unicode would translate into an executable block of code.\nThanks to the Debian Samba maintainers for discovering this issue, and to\nthe Samba team for providing the fix (and the problem description text above.)","This content is licensed under the Creative Commons Attribution 4.0 International License (https://creativecommons.org/licenses/by/4.0/). If you distribute this content, or a modified version of it, you must provide attribution to Red Hat Inc. and provide a link to the original."]},"document_type":"Security Advisory"}}