{"cvrfdoc":{"document_title":"Red Hat Security Advisory: conga security, bug fix, and enhancement update","document_distribution":"Copyright © 2021 Red Hat, Inc. All rights reserved.","document_references":{"reference":[{"description":"https://access.redhat.com/errata/RHSA-2007:0640","type":"Self","url":"https://access.redhat.com/errata/RHSA-2007:0640"},{"description":"http://www.redhat.com/security/updates/classification/#moderate","type":"External","url":"http://www.redhat.com/security/updates/classification/#moderate"}]},"aggregate_severity":"Moderate","document_tracking":{"initial_release_date":"2007-11-07T09:00:00Z","identification":{"id":"RHSA-2007:0640"},"revision_history":{"revision":{"date":"2007-11-08T09:19:00Z","number":"5","description":"Current version"}},"generator":{"date":"2021-08-23T04:28:00Z","engine":"Red Hat SDEngine 3.0.0"},"current_release_date":"2007-11-08T09:19:00Z","version":"5","status":"Final"},"product_tree":{"relationship":[{"relates_to_product_reference":"5Server-Cluster","product_reference":"conga-0:0.10.0-6.el5","full_product_name":{"product_id":"5Server-Cluster:conga-0:0.10.0-6.el5","cpe":"cpe:/a:redhat:rhel_cluster:5","product_name":"conga-0:0.10.0-6.el5 as a component of Red Hat Enterprise Linux Clustering (v. 5 server)"},"relation_type":"Default Component Of"}],"branch":[{"name":"Red Hat Enterprise Linux","type":"Product Family","branch":[{"name":"Red Hat Enterprise Linux Clustering (v. 5 server)","full_product_name":{"product_id":"5Server-Cluster","cpe":"cpe:/a:redhat:rhel_cluster:5","product_name":"Red Hat Enterprise Linux Clustering (v. 5 server)"},"type":"Product Name"}]},{"name":"conga-0:0.10.0-6.el5","full_product_name":{"product_id":"conga-0:0.10.0-6.el5","cpe":"cpe:/a:redhat:rhel_cluster:5","product_name":"conga-0.10.0-6.el5.src.rpm"},"type":"Product Version"}]},"document_publisher":{"issuing_authority":"Red Hat Product Security","contact_details":"secalert@redhat.com","type":"Vendor"},"vulnerability":[{"notes":{"note":"ricci is vulnerable to a connect DoS attack"},"cve":"CVE-2007-4136","references":{"reference":[{"description":"CVE-2007-4136","url":"https://access.redhat.com/security/cve/CVE-2007-4136"},{"description":"bz#336101: CVE-2007-4136 ricci is vulnerable to a connect DoS attack","url":"https://bugzilla.redhat.com/show_bug.cgi?id=336101"}]},"release_date":"2007-10-31T00:00:00Z","involvements":{"involvement":{"party":"Vendor","status":"Completed"}},"product_statuses":{"status":{"product_id":["5Server-Cluster:conga-0:0.10.0-6.el5"],"type":"Fixed"}},"remediations":{"remediation":{"description":"Before applying this update, make sure that all previously-released\nerrata relevant to your system have been applied.  \nThis update is available via Red Hat Network.  Details on how to use \nthe Red Hat Network to apply this update are available at\nhttp://kbase.redhat.com/faq/FAQ_58_10188","type":"Vendor Fix","url":"https://access.redhat.com/errata/RHSA-2007:0640"}},"threats":{"threat":{"description":"Moderate","type":"Impact"}},"discovery_date":"2007-08-22T00:00:00Z","cvss_score_sets":{"score_set":{"base_score":"3.3","vector":"AV:A/AC:L/Au:N/C:P/I:N/A:N"}},"ordinal":"1"}],"document_notes":{"note":["Updated conga packages that correct a security flaw and provide bug fixes\nand add enhancements are now available.\nThis update has been rated as having moderate security impact by the Red\nHat Security Response Team.","The Conga package is a web-based administration tool for remote cluster and\nstorage management.\nA flaw was found in ricci during a code audit.  A remote attacker who is\nable to connect to ricci could cause ricci to temporarily refuse additional\nconnections, a denial of service (CVE-2007-4136).\nFixes in this updated package include:\n* The nodename is now set for manual fencing.\n* The node log no longer displays in random order.\n* A bug that prevented a node from responding when a cluster was deleted is\nnow fixed.\n* A PAM configuration that incorrectly called the deprecated module\npam_stack was removed.\n* A bug that prevented some quorum disk configurations from being accepted\nis now fixed.\n* Setting multicast addresses now works properly.\n* rpm -V on luci no longer fails. \n* The user interface rendering time for storage interface is now faster.\n* An error message that incorrectly appeared when rebooting nodes during\ncluster creation was removed.\n* Cluster snaps configuration (an unsupported feature) has been removed\naltogether to prevent user confusion. \n* A user permission bug resulting from a luci code error is now fixed.\n* luci and ricci init script return codes are now LSB-compliant.\n* VG creation on cluster nodes now defaults to \"clustered\".\n* An SELinux AVC bug that prevented users from setting up shared storage on\nnodes is now fixed.\n* An access error that occurred when attempting to access a cluster node\nafter its cluster was deleted is now fixed.\n* IP addresses can now be used to create clusters. \n* Attempting to configure a fence device no longer results in an\nAttributeError.\n* Attempting to create a new fence device to a valid cluster no longer\nresults in a KeyError.\n* Several minor user interface validation errors have been fixed, such as\nenforcing cluster name length and fence port, etc.\n* A browser lock-up that could occur during storage configuration has been\nfixed.\n* Virtual service creation now works without error.\n* The fence_xvm tag is no longer misspelled in the cluster.conf file.\n* Luci failover forms are complete and working.\n* Rebooting a fresh cluster install no longer generates an error message.\n* A bug that prevented failed cluster services from being started is now\nfixed.\n* A bug that caused some cluster operations (e.g., node delete) to fail on\nclusters with mixed-cased cluster names is now fixed.\n* Global cluster resources can be reused when constructing cluster\nservices.\nEnhancements in this updated package include:\n* Users can now access Conga through Internet Explorer 6.\n* Dead nodes can now be evicted from a cluster.\n* Shared storage on new clusters is now enabled by default.\n* The fence user-interface flow is now simpler.\n* A port number is now shown in ricci error messages.\n* The kmod-gfs-xen kernel module is now installed when creating a cluster.\n* Cluster creation status is now shown visually.\n* User names are now sorted for display.\n* The fence_xvmd tag can now be added from the dom0 cluster nodes.\n* The ampersand character (&) can now be used in fence names.\n* All packaged files are now installed with proper owners and permissions.\n* New cluster node members are now properly initialized.\n* Storage operations can now be completed even if an LVM snapshot is present.\n* Users are now informed via dialog when nodes are rebooted as part of a\ncluster operation.\n* Failover domains are now properly listed for virtual services and\ntraditional clustered services.\n* Luci can now create and distribute keys for fence_xvmd.\nAll Conga users are advised to upgrade to this update, which applies these\nfixes and enhancements.","This content is licensed under the Creative Commons Attribution 4.0 International License (https://creativecommons.org/licenses/by/4.0/). If you distribute this content, or a modified version of it, you must provide attribution to Red Hat Inc. and provide a link to the original."]},"document_type":"Security Advisory"}}