{"cvrfdoc":{"document_title":"Red Hat Security Advisory: up2date improperly checks the GPG package signatures.","document_distribution":"Copyright © 2021 Red Hat, Inc. All rights reserved.","document_references":{"reference":[{"description":"https://access.redhat.com/errata/RHSA-2003:255","type":"Self","url":"https://access.redhat.com/errata/RHSA-2003:255"},{"description":"","type":"External","url":""}]},"aggregate_severity":"","document_tracking":{"initial_release_date":"2003-08-08T16:32:00Z","identification":{"id":"RHSA-2003:255"},"revision_history":{"revision":{"date":"2003-08-08T00:00:00Z","number":"1","description":"Current version"}},"generator":{"date":"2021-08-23T04:26:00Z","engine":"Red Hat SDEngine 3.0.0"},"current_release_date":"2003-08-08T00:00:00Z","version":"1","status":"Final"},"document_publisher":{"issuing_authority":"Red Hat Product Security","contact_details":"secalert@redhat.com","type":"Vendor"},"vulnerability":[{"notes":{"note":"security flaw"},"cve":"CVE-2003-0546","references":{"reference":[{"description":"CVE-2003-0546","url":"https://access.redhat.com/security/cve/CVE-2003-0546"},{"description":"bz#1617049: CVE-2003-0546 security flaw","url":"https://bugzilla.redhat.com/show_bug.cgi?id=1617049"}]},"release_date":"2003-08-08T00:00:00Z","involvements":{"involvement":{"party":"Vendor","status":"Completed"}},"remediations":{"remediation":{"description":"Before applying this update, make sure all previously released errata\nrelevant to your system have been applied.\nTo update all RPMs for your particular architecture, run:\nrpm -Fvh [filenames]\nwhere [filenames] is a list of the RPMs you wish to upgrade.  Only those\nRPMs which are currently installed will be updated.  Those RPMs which are\nnot installed but included in the list will not be updated.  Note that you\ncan also use wildcards (*.rpm) if your current directory *only* contains the\ndesired RPMs.\nPlease note that this update is also available via Red Hat Network.  Many\npeople find this an easier way to apply updates.  To use Red Hat Network,\nlaunch the Red Hat Update Agent with the following command:\nup2date\nThis will start an interactive process that will result in the appropriate\nRPMs being upgraded on your system.","type":"Vendor Fix","url":"https://access.redhat.com/errata/RHSA-2003:255"}},"ordinal":"1"}],"document_notes":{"note":["Updated up2date packages for Red Hat Linux 8.0 and 9 fix RPM GPG signature\nverification.","The Red Hat Update Agent, up2date, automatically queries the Red Hat\nNetwork servers and determines which packages need to be updated on\na machine.\nVersions 3.0.7 and 3.1.23 of up2date (the versions found in Red Hat Linux\n8.0 and 9) check RPM GPG signatures incorrectly.\nThis bug allows packages with no GPG signature to be installed by\nup2date if they are provided by the Red Hat Network servers. The intended\nbehaviour is that only packages signed with the Red Hat package signing key\nare installed. \nBecause connections to the Red Hat Network servers are authenticated and\nverified using of SSL, it is nearly impossible to intercept the connection\nto Red Hat Network servers and supply unsigned packages. For this reason,\nto take advantage of this exploit an attacker must compromise the Red Hat\nNetwork servers at Red Hat and make unsigned packages appear on Red Hat\nNetwork.\nThese facts make the risk of exploiting this bug very low. However,\nit is advised that all users of up2date install the packages contained\nwithin this erratum, which correct this issue by rejecting and refusing to\ninstall any packages with no GPG signature -- treating such packages in the\nsame way as those with bad GPG signatures.\nNote: All other variations of package signature checking work correctly. \nRed Hat would like to thank Barry Nathan for finding and reporting this error.","This content is licensed under the Creative Commons Attribution 4.0 International License (https://creativecommons.org/licenses/by/4.0/). If you distribute this content, or a modified version of it, you must provide attribution to Red Hat Inc. and provide a link to the original."]},"document_type":"Security Advisory"}}