{"cvrfdoc":{"document_title":"Red Hat Security Advisory: Updated vte packages fix gnome-terminal vulnerability","document_distribution":"Copyright © 2021 Red Hat, Inc. All rights reserved.","document_references":{"reference":[{"description":"https://access.redhat.com/errata/RHSA-2003:053","type":"Self","url":"https://access.redhat.com/errata/RHSA-2003:053"},{"description":"","type":"External","url":""}]},"aggregate_severity":"","document_tracking":{"initial_release_date":"2003-02-25T01:08:00Z","identification":{"id":"RHSA-2003:053"},"revision_history":{"revision":{"date":"2003-02-06T00:00:00Z","number":"1","description":"Current version"}},"generator":{"date":"2021-08-23T04:26:00Z","engine":"Red Hat SDEngine 3.0.0"},"current_release_date":"2003-02-06T00:00:00Z","version":"1","status":"Final"},"document_publisher":{"issuing_authority":"Red Hat Product Security","contact_details":"secalert@redhat.com","type":"Vendor"},"vulnerability":[{"notes":{"note":"security flaw"},"cve":"CVE-2003-0070","references":{"reference":[{"description":"CVE-2003-0070","url":"https://access.redhat.com/security/cve/CVE-2003-0070"},{"description":"bz#1616950: CVE-2003-0070 security flaw","url":"https://bugzilla.redhat.com/show_bug.cgi?id=1616950"}]},"release_date":"2003-02-24T00:00:00Z","involvements":{"involvement":{"party":"Vendor","status":"Completed"}},"remediations":{"remediation":{"description":"Before applying this update, make sure all previously released errata\nrelevant to your system have been applied.\nTo update all RPMs for your particular architecture, run:\nrpm -Fvh [filenames]\nwhere [filenames] is a list of the RPMs you wish to upgrade.  Only those\nRPMs which are currently installed will be updated.  Those RPMs which are\nnot installed but included in the list will not be updated.  Note that you\ncan also use wildcards (*.rpm) if your current directory *only* contains the\ndesired RPMs.\nPlease note that this update is also available via Red Hat Network.  Many\npeople find this an easier way to apply updates.  To use Red Hat Network,\nlaunch the Red Hat Update Agent with the following command:\nup2date\nThis will start an interactive process that will result in the appropriate\nRPMs being upgraded on your system.","type":"Vendor Fix","url":"https://access.redhat.com/errata/RHSA-2003:053"}},"ordinal":"1"}],"document_notes":{"note":["Updated vte packages that fix a vulnerability in gnome-terminal are\navailable for Red Hat Linux 8.0.","VTE is an terminal emulator widget used by software such as gnome-terminal.\nOne feature that most terminal emulators support is the ability\nfor the shell to set the title of the window using an escape sequence. \nCertain xterm variants also provide an escape sequence for reporting the\ncurrent window title.  This essentially takes the current title and places\nit directly on the command line.  This feature could be potentially\nexploited if an attacker can cause carefully crafted escape sequences to be\ndisplayed on a vulnerable terminal emulator used by their victim.\nSince it is not possible to embed a carriage return into the window title\nitself, the attacker would have to convince the victim to hit enter for it\nto process the title as a command, although the attacker can perform a\nnumber of actions to increase the likelyhood of this happening.\nVTE is vulnerable to this issue and is used as the default terminal\nemulator for versions of gnome-terminal shipped with Red Hat Linux 8.0. \nPrevious releases of Red Hat Linux do not contain a vulnerable version of\ngnome-terminal.\nUsers of gnome-terminal on Red Hat Linux 8.0 are advised to upgrade to\nthese errata packages, which contain a patch to disable the title reporting\nfunctionality.\nRed Hat would like to thank H D Moore for bringing these issues to our\nattention.\nPlease note; because this update contains a fixed shared library used by\ngnome-terminal, the vulnerable code will continue to be in use as long as\nany gnome-terminal session remains active. The easiest way to ensure that\nthe vulnerable code is no longer in use is to log out of your window\nmanager. Alternatively all running gnome-terminal sessions can be closed.","This content is licensed under the Creative Commons Attribution 4.0 International License (https://creativecommons.org/licenses/by/4.0/). If you distribute this content, or a modified version of it, you must provide attribution to Red Hat Inc. and provide a link to the original."]},"document_type":"Security Advisory"}}