{"cvrfdoc":{"document_title":"Red Hat Security Advisory: Red Hat Enterprise Virtualization Manager security update","document_distribution":"Copyright © 2021 Red Hat, Inc. All rights reserved.","document_references":{"reference":[{"description":"https://access.redhat.com/errata/RHSA-2010:0613","type":"Self","url":"https://access.redhat.com/errata/RHSA-2010:0613"},{"description":"http://www.redhat.com/security/updates/classification/#moderate","type":"External","url":"http://www.redhat.com/security/updates/classification/#moderate"},{"description":"http://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Virtualization_for_Servers/2.2/html/Technical_Notes/index.html","type":"External","url":"http://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Virtualization_for_Servers/2.2/html/Technical_Notes/index.html"}]},"aggregate_severity":"Moderate","document_tracking":{"initial_release_date":"2010-08-19T21:38:00Z","identification":{"id":"RHSA-2010:0613"},"revision_history":{"revision":{"date":"2010-08-19T17:38:00Z","number":"1","description":"Current version"}},"generator":{"date":"2021-08-23T04:47:00Z","engine":"Red Hat SDEngine 3.0.0"},"current_release_date":"2010-08-19T17:38:00Z","version":"1","status":"Final"},"document_publisher":{"issuing_authority":"Red Hat Product Security","contact_details":"secalert@redhat.com","type":"Vendor"},"vulnerability":[{"notes":{"note":"RHEV-M VDC - GUI: Man in the middle attack possible on the GUI to Backend SSL connection"},"cve":"CVE-2009-3552","references":{"reference":[{"description":"CVE-2009-3552","url":"https://access.redhat.com/security/cve/CVE-2009-3552"},{"description":"bz#528890: CVE-2009-3552 RHEV-M VDC - GUI: Man in the middle attack possible on the GUI to Backend SSL connection","url":"https://bugzilla.redhat.com/show_bug.cgi?id=528890"}]},"release_date":"2010-08-19T00:00:00Z","involvements":{"involvement":{"party":"Vendor","status":"Completed"}},"remediations":{"remediation":{"description":"Before applying this update, make sure all previously-released errata\nrelevant to your system have been applied.\nThis update is available via the Red Hat Network. Details on how to\nuse the Red Hat Network to apply this update are available at\nhttp://kbase.redhat.com/faq/docs/DOC-11259","type":"Vendor Fix","url":"https://access.redhat.com/errata/RHSA-2010:0613"}},"threats":{"threat":{"description":"Moderate","type":"Impact"}},"discovery_date":"2009-10-14T00:00:00Z","cvss_score_sets":{"score_set":{"base_score":"3.3","vector":"AV:A/AC:L/Au:N/C:N/I:P/A:N"}},"ordinal":"1"}],"document_notes":{"note":["Red Hat Enterprise Virtualization Manager 2.2.2 is now available for Red\nHat Enterprise Virtualization.\nThe Red Hat Security Response Team has rated this update as having moderate\nsecurity impact. A Common Vulnerability Scoring System (CVSS) base score,\nwhich gives a detailed severity rating, is available from the CVE link in\nthe References section.","Red Hat Enterprise Virtualization Manager is a visual tool for centrally\nmanaging collections of virtual servers running Red Hat Enterprise Linux\nand Microsoft Windows. This package also includes the Red Hat Enterprise\nVirtualization Manager API, a set of scriptable commands that give\nadministrators the ability to perform queries and operations on Red Hat\nEnterprise Virtualization Manager.\nIt was found that the SSL certificate was not verified when using the\nclient-side Red Hat Enterprise Virtualization Manager interface (a Windows\nPresentation Foundation (WPF) XAML browser application) to connect to the\nRed Hat Enterprise Virtualization Manager. An attacker on the local network\ncould use this flaw to conduct a man-in-the-middle attack, tricking the\nuser into thinking they are viewing the Red Hat Enterprise Virtualization\nManager when the content is actually attacker-controlled, or modifying\nactions a user requested Red Hat Enterprise Virtualization Manager to\nperform. (CVE-2009-3552)\nNote: As part of the fix for CVE-2009-3552, this update changes the way the\nclient-side Red Hat Enterprise Virtualization Manager interface\ncommunicates with the Red Hat Enterprise Virtualization Manager. After\ninstalling this update, the following steps must be performed when using\nHTTPS (that is, browsing to \"https://localhost/RHEVmanager\" or using the\nnew \"RHEVManager SSL\" shortcut):\n1) If you have previously browsed to the administrator portal using HTTP,\nyou must remove the \"RHEVManager/\" cookie from Internet Explorer. After\nremoving this cookie, restart Internet Explorer.\n2) Navigate to \"https://localhost/RHEVmanager\". You will be prompted to\ninstall the Red Hat Enterprise Virtualization Manager CA (Certificate\nAuthority) certificate. Once installed, restart Internet Explorer.\nIt is recommended that you use the \"https://\" link or the \"RHEVManager SSL\"\nshortcut to connect to the administrator portal, and no longer use the\n\"http://\" link.\nThis updated Red Hat Enterprise Virtualization Manager package also fixes\nseveral bugs. Documentation for these bug fixes will be available shortly\nfrom\nhttp://docs.redhat.com/docs/en-US/Red_Hat_Enterprise_Virtualization_for_Servers/2.2/html/Technical_Notes/index.html\nAll Red Hat Enterprise Virtualization Manager users are advised to install\nthis updated package, which corrects this issue and fixes the bugs noted\nin the Technical Notes document, linked to in the References.","This content is licensed under the Creative Commons Attribution 4.0 International License (https://creativecommons.org/licenses/by/4.0/). If you distribute this content, or a modified version of it, you must provide attribution to Red Hat Inc. and provide a link to the original."]},"document_type":"Security Advisory"}}